{"statement": "The research plan has a novel approach by studying the effect of reproductive state and social environment on female-female aggression in gorillas.", "type": "strength", "axis": "contribution", "severity": "major"}
{"statement": "The use of observational data without experimental manipulation limits the ability to establish causation between energetic needs, social environment, and aggression patterns.", "type": "weakness", "axis": "soundness", "severity": "minor"}
{"statement": "The suggestion that the difference observed in female aggression direction between groups with different sex composition might be indicative of male presence buffering aggression seems speculative, as no direct evidence of male intervention or support was reported.", "type": "weakness", "axis": "soundness", "severity": "major"}
{"statement": "The use of reproductive state as a proxy for energetic need is an indirect measure and does not account for actual energy expenditure or caloric intake, which weakens the claims that female energetic need induces risk-taking.", "type": "weakness", "axis": "soundness", "severity": "major"}
{"statement": "The research plan describes how group size can affect aggression patterns in some species but does not include it as an explanation variable in the linear mixed-effects model, despite stating that overall group size can conflate opposing effects of females and males.", "type": "weakness", "axis": "soundness", "severity": "minor"}
{"statement": "There should be more details given about how the Elo-ratings will be calculated, including whether they will be calculated by the day or by the month when pooling avoidance/displacement behaviors throughout the study period.", "type": "weakness", "axis": "soundness", "severity": "minor"}
{"statement": "The research plan does not address how rank fluctuations will be handled when individuals enter or leave groups with stable hierarchies, particularly regarding the time needed for hierarchy stabilization and whether aggressive behaviors are more common during these fluctuations.", "type": "weakness", "axis": "soundness", "severity": "minor"}
{"statement": "In the mixed model design, only the interaction score between the female cycling stage and other stages is compared, but the model could be expanded with more pairwise comparisons between different reproductive states.", "type": "weakness", "axis": "soundness", "severity": "minor"}
{"statement": "The research plan uses aggression rates rather than dominance rank as measured by Elo scores as the main outcome variable, but there is no explanation for this choice or how results would differ if Elo scores were used instead.", "type": "weakness", "axis": "soundness", "severity": "minor"}
{"statement": "It would be helpful to clarify how aggressive behaviors differ from those used to calculate Elo scores, or whether they overlap in the methodology.", "type": "weakness", "axis": "soundness", "severity": "minor"}
