{"statement": "This study collected an excellent dataset to address the question of relative effects of genetic and species diversity on ecosystem functioning, enhancing our understanding of genetic diversity effects in aquatic ecosystems.", "type": "strength", "axis": "contribution", "severity": "major"}
{"statement": "The study collected an extensive dataset that includes species diversity of primary producers (riparian trees), primary consumers (macroinvertebrate shredders), and secondary consumers (fish), along with genetic diversity of the dominant species at each trophic level, biomass production, decomposition rates, and environmental data.", "type": "strength", "axis": "soundness", "severity": "major"}
{"statement": "Environmental variation was included in the analyses using piecewise Structural Equation Models to test if the environment would modulate the effects of biodiversity on ecosystem functions.", "type": "strength", "axis": "soundness", "severity": "minor"}
{"statement": "The study design has resulted in a robust dataset to ask questions about the relative importance of genetic and species diversity of ecosystem function across and within trophic levels.", "type": "strength", "axis": "soundness", "severity": "minor"}
{"statement": "As species and genetic diversity are often correlated but also can have reciprocal feedbacks on each other, there may be constraints that underpin interpretation of results, it may be helpful to run SEM with links between levels of diversity.", "type": "weakness", "axis": "soundness", "severity": "major"}
{"statement": "The characterization of this research as a meta-analysis is not accurate since this is a single study of multiple sites within a single region and a specific time point, rather than a collection of multiple studies or ecosystems conducted by multiple authors.", "type": "weakness", "axis": "soundness", "severity": "minor"}
{"statement": "The study is very well written and examines the interesting question of whether within-species or among-species diversity correlates with ecosystem functioning, and whether these effects are consistent across trophic levels.", "type": "strength", "axis": "contribution", "severity": "minor"}
{"statement": "The different measures of diversity and function for the different trophic levels are measured over very different spatial scales, for example, trees along 200 m transects and invertebrate sampling using 15 cm traps, making it unclear whether trees 200 m away are having an effect on small-scale function.", "type": "weakness", "axis": "soundness", "severity": "major"}
{"statement": "More information is needed on the actual diversity gradients, as surveys of natural systems involve species that have already gone through selection filters from a regional pool, and if genetic diversity gradients span an order of magnitude more than species diversity gradients, genetic diversity can explain much more variance.", "type": "weakness", "axis": "soundness", "severity": "major"}
{"statement": "Species diversity effects on function are often asymptotic at high diversity, so if sampling occurs only at the high diversity range, we should not expect a strong effect.", "type": "weakness", "axis": "soundness", "severity": "major"}
{"statement": "The ecosystem functions measured are largely biomass estimates (except decomposition), and it is unclear how the biomass of a single species can be construed as an ecosystem function.", "type": "weakness", "axis": "soundness", "severity": "major"}
