{"statement": "The applicability of the findings to full-length DVL2 protein, hence the physiological relevance, is limited because the research plan depends almost completely on DVL2 mutants which lack the DEP domain and nuclear export signal (NES), failing to establish DEP domain-mediated interactions including those with FZD receptors.", "type": "weakness", "axis": "soundness", "severity": "major"}
{"statement": "The DEP domain itself represents a dimerization/tetramerization interface, which could affect the protein condensate formation of the mutants used in the domain mapping experiments.", "type": "weakness", "axis": "soundness", "severity": "major"}
{"statement": "The DVL2 mutants lacking nuclear export signal localize into the nucleus, which has different biochemical & biophysical properties than the cytoplasm where DVL typically resides, affecting condensate formation and making comparisons with physiological conditions problematic.", "type": "weakness", "axis": "soundness", "severity": "major"}
{"statement": "In the nucleus, most of the DVL binding partners, including relevant kinases which were reported to affect protein condensate formation, are missing, further limiting the physiological relevance of the nuclear localization studies.", "type": "weakness", "axis": "soundness", "severity": "major"}
{"statement": "The use of an overexpression system in the functional validation experiments, while suitable for comparing DVL2 protein condensate features, falls short in functional assays and could benefit from employing established rescue systems using DVL1/2/3 knockout cells and re-expression of DVL variants.", "type": "weakness", "axis": "soundness", "severity": "major"}
{"statement": "The sucrose density gradient ultracentrifugation approach for endogenous complex detection cannot determine the number of proteins involved nor whether those are homo-complexes, requiring super-resolution imaging or structural analyses to support these claims.", "type": "weakness", "axis": "soundness", "severity": "minor"}
{"statement": "The domain mapping analyses rely solely on overexpressed proteins, which contradicts the initial focus on endogenous, physiologically relevant DVL interactions, clustering, and condensate formation.", "type": "weakness", "axis": "soundness", "severity": "major"}
{"statement": "Mutants lacking activity/complex formation in the domain mapping experiments, such as DVL2_1-418, may need further validation since DVL2_1-506 (same mutant but with DEP) seems to form condensates and is functional in WNT signalling, suggesting these differences could be caused by the lack of DEP domain and/or folding differences.", "type": "weakness", "axis": "soundness", "severity": "minor"}
{"statement": "The functional assays including all reporter assays should be performed in DVL1-3 KO cells to explore specifically the behaviour of the investigated mutants rather than in the presence of endogenous DVL proteins.", "type": "weakness", "axis": "soundness", "severity": "major"}
{"statement": "The comparability between condensates found in the cytoplasm (usually for wild-type DVL) with those located in the nucleus (DEP mutants) is questionable, raising concerns about the validity of comparing results from these different cellular compartments.", "type": "weakness", "axis": "soundness", "severity": "major"}
{"statement": "To strengthen the research plan, the relevant mutations should be introduced in the endogenous locus using approaches like Cas9 with donor templates encoding the required exons, rather than relying on overexpression systems.", "type": "weakness", "axis": "soundness", "severity": "major"}
