{"statement": "The work provides more evidence of the importance of data quality and representation for ligand-based virtual screening approaches.", "type": "strength", "axis": "contribution", "severity": "minor"}
{"statement": "This work would provide new evidence about the importance of inferring models from high-quality data and that, if such a condition is met, it is not necessary to use complex computational methods to obtain predictive models.", "type": "strength", "axis": "contribution", "severity": "minor"}
{"statement": "Leaving aside their would-be new curated BRAF dataset, the work lacks novelty since it is a topic widely studied in chemoinformatics and medicinal chemistry.", "type": "weakness", "axis": "contribution", "severity": "major"}
{"statement": "The conclusions drawn here correspond to the analysis of only one high-quality dataset where the similarity between the molecules is not quantitatively assessed (maybe active and inactive molecules are very dissimilar and any ML algorithm and fingerprint could obtain good results).", "type": "weakness", "axis": "soundness", "severity": "major"}
{"statement": "To generalize conclusions potentially drawn from this work, it would be fundamental to repeat the analysis with other high-quality datasets.", "type": "weakness", "axis": "soundness", "severity": "major"}
{"statement": "There is no information about the new BRAF dataset (e.g., where the molecules were obtained from or why the inactive molecules provide better results than the 'less active' from ChEMBL... what differentiates them?).", "type": "weakness", "axis": "soundness", "severity": "minor"}
{"statement": "When using decoys to evaluate the models it is important to consider that decoys were generated to be topologically different from active compounds by the comparison of the ECFP4 fingerprints using the Tanimoto coefficient. Therefore, it is quite obvious that when fingerprints are used to characterize molecules, the models will be able to easily discriminate them.", "type": "weakness", "axis": "soundness", "severity": "major"}
{"statement": "The authors should plan to evaluate the chemical similarity between the 3600 actives in the training dataset and the 500 actives in the testing set. If some of them were similar, the testing results would be very good but partially due to information leakage.", "type": "weakness", "axis": "soundness", "severity": "major"}
{"statement": "The minimal number of actives used is 500 while the number of inactives ranges from 500 to 3600. This is quite different from real applications where the number of expected actives in the screening library would be at most 1-2% of the whole database. The authors should further reduce the number of actives (e.g. 125, 25, 5, 1), and evaluate their model's performance.", "type": "weakness", "axis": "soundness", "severity": "major"}
{"statement": "BRAF is a well studied drug target with thousands of known actives. In real applications, the target may only have a handful of known actives. The authors should try to apply their approach to a couple other targets that have less known actives than BRAF, to evaluate their method's transferability.", "type": "weakness", "axis": "soundness", "severity": "major"}
