{"statement": "Unlike most research involving artificial language or language in general, the task engaged in this manuscript did not require (or test) learning of meaning or translation. Instead, the artificial words were arbitrarily categorised and memory was tested for that categorisation. This somewhat limits the interpretation of the results as they pertain to language science, and qualifies comparisons with other language-related sleep studies that the manuscript builds on.", "type": "weakness", "axis": "contribution", "severity": "major"}
{"statement": "It is unclear how reward or lack thereof would translate cleanly into a categorisation of hits/misses/correct rejections/false alarms. If the item was of the non-rewarded class and the participant got it correct, they avoided loss. Why would that be considered a correct rejection, as the text suggests? This seems to mix together signal detection nomenclature and loss-aversion types of studies.", "type": "weakness", "axis": "soundness", "severity": "major"}
{"statement": "The linguistic statistics used for establishing the artificial words are all based on American English, and are therefore in misalignment with the spoken language of the participants (which was German). The authors should address this limitation and discuss possible differences between the languages.", "type": "weakness", "axis": "soundness", "severity": "major"}
{"statement": "For a between-subjects design, the sample size is too small (N = 22).", "type": "weakness", "axis": "soundness", "severity": "major"}
{"statement": "Even though the task itself is innovative, there would have been tasks better suited to address the research question. The main disadvantage the task and the operationalisation of memory performance (d') have is that single-trial performance cannot be calculated. Consequently, choosing individual items for TMR is not possible. Additionally, TMR of low vs. high difficulty is conducted between subjects (and independently of pre-sleep memory performance) which is a consequence of the task design.", "type": "weakness", "axis": "soundness", "severity": "major"}
{"statement": "The motivation for why this task has been used is missing in the plan.", "type": "weakness", "axis": "soundness", "severity": "minor"}
{"statement": "Considering that the TMR benefits are based on changes in memory categorization between participants, it could be argued that the individuals in the high PP group were more susceptible to TMR than those in the low PP group for reasons other than the phonotactic probabilities of the stimuli (e.g., these individuals might be more attentive to sounds in the environment during sleep).", "type": "weakness", "axis": "soundness", "severity": "major"}
{"statement": "Another manipulation in the study is that participants learn whether the words are linked to a monetary reward or not, however, the rationale for this manipulation is unclear. For instance, it is unclear whether the authors expect the reward to interact with the TMR effects.", "type": "weakness", "axis": "soundness", "severity": "minor"}
{"statement": "The task itself is innovative.", "type": "strength", "axis": "contribution", "severity": "minor"}
