{"statement": "The authors adjust a previously used experimental design to include correlated evidence in a simple, yet powerful way that is easy to understand and intuitive, such that participants don't need extensive training to perform the task.", "type": "strength", "axis": "contribution", "severity": "major"}
{"statement": "Limited training makes it more likely that the observed behavior is natural and reflective of everyday decision-making.", "type": "strength", "axis": "soundness", "severity": "minor"}
{"statement": "The design allowed the authors to make the amount of decision-related evidence equal across different correlation magnitudes, which makes it easy to assess whether participants correctly take account of these correlations when weighing evidence.", "type": "strength", "axis": "soundness", "severity": "major"}
{"statement": "The idea introduces correlated evidence in a relatively simple way, but this framing risks reducing the conceptual novelty: it defaults to the well-established DDM, which already has strong empirical support, few parameters, and a normative basis for perceptual decisions. As a result, the idea may contribute less beyond established models.", "type": "strength", "axis": "soundness", "severity": "major"}
{"statement": "The idea outlines how correlations should affect DDM parameters and how mis-estimations might manifest, but conceptually it remains unclear whether this framing truly captures participant behavior. By treating the continuum from perfect weighting to complete ignorance as exhaustive, the idea may oversimplify the range of possible strategies.", "type": "strength", "axis": "soundness", "severity": "major"}
{"statement": "Given that correlation magnitudes are estimated from limited data in the experimental design where correlation magnitude varies across trials, the subjective estimates might be biased towards their average, which implies that the normative strategy might differ across correlation magnitudes, unlike what is suggested in the research plan.", "type": "weakness", "axis": "soundness", "severity": "major"}
{"statement": "The 'particle location' in DDMs ceases to correspond to the logLR as soon as the strength of evidence varies across trials and isn't known by the decision maker before the start of each trial, which occurs in the proposed experiment where evidence strength is modulated by both the distance of the cue location mean from the decision boundary and by the correlation magnitude.", "type": "weakness", "axis": "soundness", "severity": "major"}
{"statement": "This deviation makes it unclear if the DDM used in the research plan indeed implements the normative strategy, or is even a good approximation to it.", "type": "weakness", "axis": "soundness", "severity": "major"}
{"statement": "Given that participants observe 5 evidence samples per second and on average require multiple seconds to form their decisions, it might be that they are able to form a fairly precise estimate of the correlation magnitude within individual trials, but whether this is indeed the case is not clear from the research plan.", "type": "weakness", "axis": "soundness", "severity": "minor"}
{"statement": "The computational approach to arrive at normative principles for evidence weighting across environments with different levels of correlation is very elegant, makes strong connections with prior work in different decision-making contexts, and should serve as a valuable reference point for future studies in this domain.", "type": "strength", "axis": "contribution", "severity": "major"}
{"statement": "The empirical study is well designed and executed, and the modelling approach applied to these data showcases a deep understanding of relationships between different parameters of the drift-diffusion model and its application to this setting.", "type": "strength", "axis": "soundness", "severity": "major"}
{"statement": "The correlation conditions are randomly interleaved across trials and are not signaled to participants in advance of each trial, making it unclear how participants are meant to have implemented the bound adjustments prescribed by the model fits.", "type": "weakness", "axis": "soundness", "severity": "minor"}
{"statement": "An interesting aspect of this task, which contrasts with most common 'univariate' perceptual decision-making tasks, is that participants need to integrate two pieces of information at a time, which may or may not require an additional computational step such as averaging of two spatial locations before adding a single quantum of evidence to the building decision variable.", "type": "weakness", "axis": "soundness", "severity": "minor"}
{"statement": "Participants are only given 200 ms to process and accumulate each pair of evidence samples, which may create a processing bottleneck causing certain pairs or individual samples to be missed.", "type": "weakness", "axis": "soundness", "severity": "minor"}
