{"statement": "For the environmental enrichment experiment, authors seem to suggest objects in the homecage are similar to (or reminiscent of) the familiar object. Thus, the effect of improved memory may not be related to enrichment per se as much as it may be related to the preservation of an object's memory through multiple retrievals, not the enriching experiences of the environment itself.", "type": "weakness", "axis": "soundness", "severity": "major"}
{"statement": "I am concerned at the interpretation that a memory is 'forgotten' across figures, especially considering the brief reminder experiments. Typically, if a reminder session can trigger the original memory or there is rapid reacquisition, then this implies there is some savings for the original content of the memory.", "type": "weakness", "axis": "contribution", "severity": "major"}
{"statement": "My major issue with the paper is the forgetting model proposed in Figure 7. The authors do not need to propose the existence of a new 'forgetting' variable that is driven by negative prediction errors. This does not add anything novel to the paper as it is not necessary to explain the data.", "type": "weakness", "axis": "contribution", "severity": "major"}
{"statement": "The authors' hypothesis that environmental enrichment alleviates forgetting because 'Experiencing extra toys and objects during environmental enrichment that are reminiscent of the previously learned familiar object might help maintain or nudge mice to infer a higher engram relevancy' is completely speculative. A much simpler explanation based on existing literature is that enrichment enhances synaptic plasticity, spine growth, etc., which in turn reduces forgetting.", "type": "weakness", "axis": "soundness", "severity": "minor"}
{"statement": "If the authors want to make their claim about environmental enrichment and object similarity, then they need to test it experimentally. For example, the enriched environment could be filled with objects that are similar or dissimilar to those used in the memory experiments. If their hypothesis is correct, only the similar condition should prevent forgetting.", "type": "weakness", "axis": "soundness", "severity": "major"}
{"statement": "It would also be good to run experiments that investigate whether multiple short re-exposures to the training context (in the presence of the objects or during optogenetic activation of the engram) could prevent forgetting.", "type": "weakness", "axis": "soundness", "severity": "minor"}
{"statement": "There are a number of studies that show boundary conditions for memory destabilization/reconsolidation. Is there any evidence that similar boundary conditions exist to make an inaccessible engram accessible?", "type": "weakness", "axis": "soundness", "severity": "minor"}
{"statement": "Knowing what process (object retrieval vs familiarity) governed the behavioural effect in the object recognition task would be of even greater significance.", "type": "weakness", "axis": "contribution", "severity": "minor"}
{"statement": "While relevance is an interesting concept that has been operationalized in the plan, it is unclear how distinct it is from extinction. Specifically, in the case where the animals are exposed to the context in the absence of the object, this could be viewed as extinction of the association between the context and the objects rather than a process of relevance.", "type": "weakness", "axis": "contribution", "severity": "major"}
