{"statement": "The paradigm used is original and effective for investigating temporal context effects across multiple time scales.", "type": "strength", "axis": "contribution", "severity": "major"}
{"statement": "The goal of assessing history biases over multiple time scales is interesting and resonates with both classic (Treisman & Williams, 1984) and recent work (Fritsche et al., 2020; Gekas et al., 2019).", "type": "strength", "axis": "contribution", "severity": "major"}
{"statement": "The manipulations used to distinguish task-related, unrelated, and stimulus-related reference frames are original and promising.", "type": "strength", "axis": "contribution", "severity": "major"}
{"statement": "The EEG analysis approach seems quite different from the behavioral experiments, involving location and color changes on streaks of consecutive stimuli shown every 100 ms with target counting tasks, which might involve different mechanisms and functions compared to the proposed behavioral experiments.", "type": "weakness", "axis": "soundness", "severity": "major"}
{"statement": "The rationale for selecting five past events as the meso-scale is unclear, given that prior history effects have been shown to extend much further back in time (Fritsche et al., 2020).", "type": "weakness", "axis": "soundness", "severity": "minor"}
{"statement": "the three classical separations are misleading: Firstly, for a perceptual scientist to call intervals in the order of seconds (rather than milliseconds), 'micro' is technically coming from the raw prawn. Secondly, the divisions are not actually time, but events: micro means one-back paradigm, one event previously, rather than defined by duration. Thirdly, meso isn't really a category, just a few micros stacked up (and there's not much data on this). And macro is basically patterns, or statistical regularities, rather than being a fixed time.", "type": "weakness", "axis": "soundness", "severity": "major"}
{"statement": "there is not enough justification for the arbitrary choice of restricting EEG decoding to a small subset of parieto-occipital electrodes. Blinks and other artifacts could have been corrected with proper algorithms (e.g., ICA) (Zhang & Luck, 2025) or even left in, as decoders are not necessarily affected by noise. Moreover, trials with blinks occurring at the stimulus time should be better removed, and the arbitrary selection of a subset of electrodes, while reducing the information in input to the decoder, does not account for trials in which a stimulus was missed (e.g., due to blinks).", "type": "weakness", "axis": "soundness", "severity": "minor"}
