{"statement": "The authors plan to use multiple interventions to manipulate NAD/NADH ratios in cells and experiments are well controlled", "type": "strength", "axis": "soundness", "severity": "major"}
{"statement": "In addition to data presented as relative to +serine and showing how some cells respond to -serine, it may also be of interest to see how absolute (not relative) NAD/NADH levels correlate with serine synthesis and serine-independent proliferation to determine whether it is the dynamic increase in the ratio that is most important, or the absolute level of the ratio.", "type": "weakness", "axis": "soundness", "severity": "minor"}
{"statement": "It would be advisable to include a quantification of the cell number and to display the proliferation rate over time rather than relying solely on Sulforhodamine B dye, as this would provide valuable insights into the timeline of cellular responses and avoid potential confounding effects associated with this indirect measure of cell proliferation based on protein content.", "type": "weakness", "axis": "soundness", "severity": "major"}
{"statement": "The mechanism by which nutrient availability is sensed and transmitted across different cellular compartments to regulate mitochondrial redox status remains unclear, which is particularly relevant for serine metabolism since its synthesis occurs in the cytosol but the authors connect it to mitochondrial respiration.", "type": "weakness", "axis": "soundness", "severity": "major"}
{"statement": "Compartment-specific measurements of NAD+/NADH ratio would help to understand to what extent the redox state is affected by nutrients in the mitochondria and in the cytoplasm, and the genetic tool LbNox could be employed to manipulate the NAD+/NADH ratio in a compartment-specific manner while avoiding the toxicity of certain compounds such as rotenone.", "type": "weakness", "axis": "soundness", "severity": "major"}
{"statement": "Another notable strength is the integration of dual stress (lipid and serine deprivation), which better mimics the complex tumor microenvironment with multiple nutrient fluctuations, raising the translational potential of these findings. ", "type": "strength", "axis": "soundness", "severity": "major"}
{"statement": "The plan focuses predominantly on mitochondrial respiration as a source of NAD+ regeneration, but it would be interesting to check other significant pathways such as NAD+ salvage, which have been implicated in supporting serine biosynthesis.", "type": "weakness", "axis": "soundness", "severity": "minor"}
{"statement": "The authors should acknowledge the limitations of short-term isotope tracing with U-13C-glucose in their experimental design, as differences in metabolic rates across cell lines can affect the kinetics of metabolite labeling, limiting the direct comparability of metabolic fluxes between them and potentially reflecting transient adaptations rather than stable metabolic reprogramming.", "type": "weakness", "axis": "soundness", "severity": "major"}
