{"statement": "The exact algorithmic advancement of the Synthesizer module beyond being some type of application wrapper around LigBuilder is unclear, including whether the grow-link approach, API for custom optimization routines, genetic algorithm, cavity detection tool, and fragment library are novel components or existing LigBuilder features.", "type": "weakness", "axis": "contribution", "severity": "major"}
{"statement": "The scientific contribution of the Synthesizer is unclear, and if there has not been any new methodological development, then it may be more appropriate to just refer to this part of the algorithm as an application layer for LigBuilder.", "type": "weakness", "axis": "contribution", "severity": "major"}
{"statement": "The use of AutoDock Vina binding energy scores in the Authenticator module to classify ligands into HABs and LABs is problematic because AutoDock Vina's energy function is primarily tuned for pose prediction and displays highly system-dependent affinity ranking capabilities.", "type": "weakness", "axis": "soundness", "severity": "major"}
{"statement": "The HAB/LAB thresholds of -7 kcal/mol or -8 kcal/mol used in the Authenticator module lack justification, and it is unclear whether these were arbitrarily selected cutoffs or determined through benchmarking with experimental data or rigorous alchemical free energy approaches.", "type": "weakness", "axis": "soundness", "severity": "major"}
{"statement": "The plan does not provide information on how the GNNs in the Generator module were trained, including critical details such as node features, edge attributes, standardization, pooling, activation functions, layers, dropout, loss functions, monitoring criteria, and learning rate adjustments.", "type": "weakness", "axis": "soundness", "severity": "major"}
{"statement": "GNN model training in the Generator module seems to occur on at most 500 molecules per training run, which is a very small number of training samples if true.", "type": "weakness", "axis": "soundness", "severity": "major"}
{"statement": "The plan lacks clarity on how upsampling will be performed and what the HAB/LAB class distributions were in the Generator module training.", "type": "weakness", "axis": "soundness", "severity": "minor"}
{"statement": "Using only synthetically generated molecules from LigBuilder for training the Generator module may make classification trivial since synthetic ligands may occupy distinct chemical space, particularly with random split k-folds validation, and without leave-class-out validation it is unclear if the model learns generalizable features.", "type": "weakness", "axis": "soundness", "severity": "major"}
{"statement": "The motivation for using QSAR models trained on docking scores is unclear when only a few hundred or thousand molecules are being sampled, as it would seem more efficient to just use AutoDock Vina directly for virtual screening.", "type": "weakness", "axis": "contribution", "severity": "minor"}
{"statement": "There is no assay to directly determine the affinity of the computationally identified compounds to the protein of interest, and it would be beneficial to show that compounds are active in a simple binding assay to confirm the findings.", "type": "weakness", "axis": "soundness", "severity": "major"}
