{"statement": "The research plan is framed with an over-reliance on the RDoC framework in the introduction, despite deviations from the RDoC framework in the methods.", "type": "weakness", "axis": "soundness", "severity": "minor"}
{"statement": "The field is also learning more about RDoC's limitations when mapping cognitive performance to biology.", "type": "weakness", "axis": "contribution", "severity": "minor"}
{"statement": "The authors focus on a single general factor of cognition (g-factor) as the core outcome of interest as opposed to different domains of cognition.", "type": "weakness", "axis": "soundness", "severity": "minor"}
{"statement": "The authors could consider predicting mental health rather than cognition as an alternative approach.", "type": "weakness", "axis": "contribution", "severity": "minor"}
{"statement": "Using mental health as a predictor could be limited by the included 9-11 year age range at baseline (where many mental health concerns are likely to be low or not well captured), as well as the nature of how the data was collected, i.e., either by self-report or from parent/caregiver report.", "type": "weakness", "axis": "soundness", "severity": "major"}
{"statement": "The ABCD sample is superb for the questions asked.", "type": "strength", "axis": "soundness", "severity": "major"}
{"statement": "It would have been highly informative to extend the analyses to datasets containing more participants with neurological/psychiatric diagnoses (e.g. HBN, POND) or extend it into adolescent/early adult onset psychopathology cohorts.", "type": "weakness", "axis": "contribution", "severity": "major"}
{"statement": "The focus on mental health in a largely normative sample leads to the predictions being largely based on the normal range. It would be interesting to subsample the data and ask how well the extremes are predicted.", "type": "weakness", "axis": "soundness", "severity": "major"}
{"statement": "strong statistical learning methods and a clear set of questions.", "type": "strength", "axis": "soundness", "severity": "major"}
{"statement": " incorporating and directly comparing the contribution of multiple imaging modalities (task fMRI, resting state fMRI, diffusion MRI, structural MRI), neurodevelopmental markers, environmental factors, and polygenic risk scores in a novel multivariate framework (via opportunistic stacking).", "type": "strength", "axis": "soundness", "severity": "major"}

