{"statement": "The strengths of the presented work lie in the sophisticated task design and the thorough investigation of their theory by use of mechanistic computational models to elucidate social decision-making and learning processes in BPD.", "type": "strength", "axis": "soundness", "severity": "major"}
{"statement": "The authors specify a primary prediction about disruption to information generalization in social decision making & learning processes, and it is clear from the research plan how their 4 main models are supposed to test this hypothesis.", "type": "strength", "axis": "soundness", "severity": "major"}
{"statement": "The topic is interesting and important, and the findings are potentially intriguing.", "type": "strength", "axis": "contribution", "severity": "major"}
{"statement": "The computational methods employed is clever and sophisticated, at the cutting edge of research in the field.", "type": "strength", "axis": "soundness", "severity": "major"}
{"statement": "On the whole, the experimental design is well-suited to the questions and the computational model analyses are thorough, including modern model-fitting procedures.", "type": "strength", "axis": "soundness", "severity": "major"}
{"statement": "Does the Intentions Game encourage competition or give participants a reason to take advantage of others? I don't think it does, so it would be useful to clarify the normative account for prosociality in the introduction.", "type": "weakness", "axis": "soundness", "severity": "minor"}
{"statement": "Rather, the research plan seems to be somewhat exploratory, largely looking at group differences (BPD vs. CON) on all of the shared computational parameters and additional indices such as belief updating and reaction times.", "type": "weakness", "axis": "soundness", "severity": "minor"}
{"statement": "Although the authors aim to conduct a model confusion analysis, this would not demonstrate that the dynamics of one model are nested within the other.", "type": "weakness", "axis": "soundness", "severity": "major"}
{"statement": "Group-specific model fitting has virtues when believes there to be two distinct populations, but there is also a risk of overfitting potentially irrelevant sample characteristics when parameters are fit group by group.", "type": "weakness", "axis": "soundness", "severity": "major"}
{"statement": "The psychometric individual difference analyses were not clearly justified in the introduction, though they could offer potentially meaningful insight into which scales may be most related to model parameters of interest.", "type": "weakness", "axis": "contribution", "severity": "minor"}
