{"statement": "The feedforward model investigated by the authors (previously introduced by Kropff & Treves, 2008) is an interesting and important alternative to models that generate grid firing patterns through 2-dimensional continuous attractor network (CAN) dynamics.", "type": "strength", "axis": "contribution", "severity": "minor"}
{"statement": "The idea does not clearly articulate the role of the 1D attractor architecture: is it essential only during training, or does it meaningfully contribute to computation in the fully trained network? More fundamentally, it is not clear whether such an attractor is required at all for the emergence of population alignment and gridness, leaving the conceptual necessity of this architectural choice in doubt.", "type": "weakness", "axis": "soundness", "severity": "major"}
{"statement": "Key controls that are missing include training on networks with other architectures, such as various architectures with randomly structured connectivity (e.g. drawing weights from exponential or Gaussian distributions).", "type": "weakness", "axis": "soundness", "severity": "major"}
{"statement": "The idea does not make clear what the low-dimensional structure of the inputs actually is, raising a conceptual gap. If the inputs themselves encode a 2D representation of location, then the apparent discrepancy between the dimensionality of the architecture and the representation may not be surprising. Without clarifying this, the idea risks overstating the novelty of the observed output structure.", "type": "weakness", "axis": "soundness", "severity": "minor"}
{"statement": "The idea leaves unresolved how network representations behave when place cells remap. It is unclear whether the proposed 1D manifold would be stably maintained, as continuous attractor network models would predict, or whether it would reorganize—raising doubts about the robustness of the conceptual framework.", "type": "weakness", "axis": "soundness", "severity": "minor"}
{"statement": "The idea assumes that the grid cell network functions as a low-dimensional attractor, but it is not clear whether this assumption is conceptually justified. Without pointing to evidence from experimental data, the idea risks relying on a theoretical claim that may not be empirically grounded.", "type": "weakness", "axis": "soundness", "severity": "minor"}
{"statement": "It is not clear that the proposal here is fundamentally new, given that in Si, Kropff and Treves (2012) recurrent connectivity was dependent on the head direction tuning and thus had a ring structure, and Urdapilleta, Si, and Treves considered connectivity that depends on the distance on a 2d plane.", "type": "weakness", "axis": "contribution", "severity": "major"}
{"statement": "The idea characterizes the connectivity within the grid cell layer as an attractor, but it is conceptually unclear whether such connectivity alone would be sufficient to sustain persistent attractor states. Without clarifying this point, the idea risks resting on an unexamined assumption.", "type": "weakness", "axis": "soundness", "severity": "major"}
{"statement": "In general, there is no exploration of how the strength of collateral interactions would affect the outcome.", "type": "weakness", "axis": "soundness", "severity": "minor"}
{"statement": "The modeling is all done in planar 2d environments, where the feedforward learning mechanism promotes the emergence of a hexagonal pattern in the single neuron tuning curve. However, the toroidal topology of grid cells in reality has been observed by Gardner et al also in the wagon wheel environment and in sleep, and there is substantial evidence based on pairwise correlations that it persists also in various other situations, in which the spatial response pattern is not a hexagonal firing pattern.", "type": "weakness", "axis": "soundness", "severity": "major"}
{"statement": "It is not clear that the mechanism proposed in the present paper would generate toroidal topology of the population activity in more complex environments. In fact, it seems likely that it will not do so.", "type": "weakness", "axis": "soundness", "severity": "major"}
{"statement": "There is weakness in the mathematical description of the dynamics - mathematical equations are formulated in discrete time steps, without a clear interpretation in terms of biophysically relevant time scales.", "type": "weakness", "axis": "soundness", "severity": "minor"}
{"statement": "It appears that there are no terms in the dynamics associated with an intrinsic time scale of the neurons or the synapses, and this introduces a difficulty in interpreting synaptic weights as being weak or strong.", "type": "weakness", "axis": "soundness", "severity": "minor"}
{"statement": "The nature of the recurrent dynamics within the grid cell network (whether it exhibits continuous attractor behavior) is not sufficiently clear.", "type": "weakness", "axis": "soundness", "severity": "major"}
