{"statement": "The study falls short of its claim that it reveals the molecular mechanisms of seasonal polyphenism, as cuticle tanning is an important part of the pear psyllid polyphenism but is not equivalent to it.", "type": "weakness", "axis": "contribution", "severity": "major"}
{"statement": "The research plan does not address other traits that distinguish between the two morphs, such as ovarian diapause, and the role of bursicon signaling in regulating these aspects of polyphenism were not measured.", "type": "weakness", "axis": "soundness", "severity": "major"}
{"statement": "The study fails to address the threshold nature of cuticular tanning in this species, although it is the threshold response to temperature and photoperiod that distinguishes this trait as a part of a polyphenism.", "type": "weakness", "axis": "soundness", "severity": "major"}
{"statement": "While miR-6012 was found to regulate bursicon expression, there is no evidence provided that this microRNA either responds to or initiates a threshold response to temperature.", "type": "weakness", "axis": "soundness", "severity": "major"}
{"statement": "The research plan does not test the threshold response of cuticle phenotypes to levels of bursicon, its receptor, or miR-6012, which are defining characteristics of polyphenism.", "type": "weakness", "axis": "soundness", "severity": "major"}
{"statement": "Quantitative measurements of a polyphenism marker should be demonstrated to result as a threshold titer or expression level to distinguish defects in polyphenism from those of its component trait.", "type": "weakness", "axis": "soundness", "severity": "major"}
{"statement": "The timed experiments in the research plan are designed for whole animals, but given the complexity of Bursicon activity in different tissues, effects detected on different days may be misleading because different tissues may respond differentially and mask each other's responses.", "type": "weakness", "axis": "soundness", "severity": "minor"}
{"statement": "The research plan lacks evidence that lower temperatures influence expression of miR-6012, as it measures expression over life stages at a single temperature rather than comparing summer form-inducing and winter form-inducing temperatures.", "type": "weakness", "axis": "soundness", "severity": "major"}
