{"statement": "The light sheet imaging technique provides lower resolution than other techniques for investigating cell class-specific long-range axonal projections from whisker-related somatosensory cortices.", "type": "weakness", "axis": "soundness", "severity": "major"}
{"statement": "The study does not extend current knowledge through high sensitivity for detecting sparse axons, high specificity of labeling of genetically defined classes of neurons, and brain wide analysis for assigning axons to detailed brain regions, which have all been published in numerous other studies.", "type": "weakness", "axis": "contribution", "severity": "major"}
{"statement": "The light sheet imaging appears to be rather low resolution compared to the many studies that have used viral tracing to look at cortical projections from genetically identified cortical neurons.", "type": "weakness", "axis": "soundness", "severity": "major"}
{"statement": "The study has the inability to resolve axons of passage and terminal fields in the investigation of whisker-related somatosensory cortex projections, which has been done in other studies with viral constructs labeling synaptophysin.", "type": "weakness", "axis": "soundness", "severity": "major"}
{"statement": "The GENSAT Cre driver lines used must have the specific line name used, not just the gene name as the GENSAT BAC-Cre lines had multiple lines for each gene and often with very different expression patterns.", "type": "weakness", "axis": "soundness", "severity": "major"}
{"statement": "There is a risk of missing axons during the post-processing step when using TrailMap for axon segmentation in the brain-wide projection analysis.", "type": "weakness", "axis": "soundness", "severity": "major"}
{"statement": "The weakness relates to the intrinsic limitations of the in toto approaches using mesoscale selective plane illumination microscopy, that currently lack the precision and resolution allowing to identify single axons, axon branching or synaptic connectivity.", "type": "weakness", "axis": "soundness", "severity": "major"}
