{"statement": "A clearly defined and straightforward mathematical definition of phenological lag allows for this method to be applied in different scientific contexts.", "type": "strength", "axis": "contribution", "severity": "major"}
{"statement": "Where data exists, other researchers can partition the effects of various abiotic forcings on phenological responses that differ from those expected from warming sensitivity alone.", "type": "strength", "axis": "contribution", "severity": "major"}
{"statement": "Identifying phenological lag and associated contributing factors provides a method by which more nuanced predictions of phenological responses to climate change can be made, thus this study could improve ecological forecasting models.", "type": "strength", "axis": "contribution", "severity": "major"}
{"statement": "The use of stepwise, automated regression may be less suitable than a hypothesis-driven approach to model selection, combined with expanded data visualization.", "type": "weakness", "axis": "soundness", "severity": "minor"}
{"statement": "The use of stepwise regression may produce inappropriate models based on factors of the sample data that may preclude or require different variable selection.", "type": "weakness", "axis": "soundness", "severity": "minor"}
{"statement": "By combining winter chilling effects, photoperiod effects, and environmental stresses that might affect phenology, the authors create a new variable that is hard to interpret.", "type": "weakness", "axis": "soundness", "severity": "major"}
{"statement": "Is it possible that mixing different types of data, studies, sample sizes, number of years, experimental set-ups, and growth habits results in artifacts that influence the results?", "type": "weakness", "axis": "soundness", "severity": "major"}
{"statement": "Now that the authors have created this new variable, phenological lag, which of the components that contribute to it has the most influence on it? Or which components are most influential in which circumstances?", "type": "weakness", "axis": "soundness", "severity": "major"}
