{"statement": "The central hypothesis that emamectin benzoate (EB), an allosteric modulator of GluCl, can upregulate the mRNA of GluCl is counterintuitive since there is no evidence that an allosteric modulator can function as a transcriptional activator for the same receptor protein.", "type": "weakness", "axis": "soundness", "severity": "major"}
{"statement": "The idea that 4th instar EB treatment directly explains the upregulation of JH in adult stages seems conceptually uncertain, since EB application at that stage is known to cause an immediate decrease in JH titer. This raises the possibility that the later increase reflects an indirect effect, which the idea does not clearly account for.", "type": "weakness", "axis": "soundness", "severity": "major"}
{"statement": "The idea that EB treatment drives an increase in Met mRNA appears conceptually at odds with established understanding in the JH field, where Met receptor levels are generally stable across developmental stages and JH presence—rather than receptor abundance—is considered the primary regulatory factor. This discrepancy raises doubts about the soundness of the proposed mechanism.", "type": "weakness", "axis": "soundness", "severity": "major"}
{"statement": "The hypothesis that Met (the receptor for JH) and JH-Met target gene Kr-h1 regulate JH titer represents an irrational claim that would be the first report of such an event in the JH field and requires in-depth analysis.", "type": "weakness", "axis": "soundness", "severity": "major"}
{"statement": "The proposed feedback loop in JH synthesis where Kr-h1 mediates JH upregulation is unreported and requires mechanistic detail beyond mere qPCR experiments to substantiate a claim completely contrary to current understanding of the JH signalling pathway.", "type": "weakness", "axis": "soundness", "severity": "major"}
{"statement": "Using whole body samples for examining mRNA of enzymes involved in JH synthesis may not reflect the situation in Corpora Allata where JH is synthesized, and working with head and neck regions would be more convincing for JH synthesis studies.", "type": "weakness", "axis": "soundness", "severity": "minor"}
{"statement": "The molecular experiments are very poorly designed and can at best be termed superficial.", "type": "weakness", "axis": "soundness", "severity": "major"}
{"statement": "It remains unclear how an increase in GluCl levels could result in increased JH regulatory genes, as acknowledged by the research plan.", "type": "weakness", "axis": "soundness", "severity": "minor"}
