{"statement": "The hypothesis that frictional instabilities rather than friction are the main drivers for discriminating flat surfaces of different sub-nanometric roughness profiles is intriguing and represents an important observation that instabilities may contribute to what humans are detecting as differences in these apparently similar samples.", "type": "strength", "axis": "contribution", "severity": "major"}
{"statement": "There is a weakness in the representativeness of the PDMS finger, the vertical motion, and the speed of sliding to real human exploration, as the real finger has multiple layers with different moduli and the stratum corneum cells have a much higher modulus than PDMS.", "type": "weakness", "axis": "soundness", "severity": "major"}
{"statement": "The slanted position of the finger can cause non-uniform pressures across the finger, and both this and the modulus differences can contribute to making the PDMS finger have much more stick-slip than a real finger.", "type": "weakness", "axis": "soundness", "severity": "major"}
{"statement": "The speeds used in the study (5, 10, 25, and 45 mm/s) are on the slow side, which contributes to more stick-slip, and humans do not tend to use a force and velocity that will cause extensive stick-slip.", "type": "weakness", "axis": "soundness", "severity": "minor"}
{"statement": "The vertical motion of both the PDMS finger and the instructed human subjects is not the motion that humans typically use to discriminate between surfaces.", "type": "weakness", "axis": "soundness", "severity": "major"}
{"statement": "The hypothesis that humans may alter their speed to feel the instability transition regions is extremely interesting.", "type": "strength", "axis": "contribution", "severity": "minor"}
{"statement": "The sample size of 10 participants is very small.", "type": "weakness", "axis": "soundness", "severity": "minor"}
{"statement": "The research plan describes a new perspective on friction perception, with the hypothesis that humans are sensitive to the instabilities of the surface rather than the coefficient of friction.", "type": "strength", "axis": "contribution", "severity": "major"}
{"statement": "The psychophysics study is centered around an odd-one-out protocol, which has the advantage of avoiding any external reference to what would mean friction or texture.", "type": "strength", "axis": "soundness", "severity": "minor"}
{"statement": "The main weakness comes from the fact that the frictional maps and the extensive psychophysics study are not made at the same time, nor with the same finger, as the frictional maps are produced with an artificial finger made out of PDMS which is a poor substitute for the complex tribological properties of skin.", "type": "weakness", "axis": "soundness", "severity": "major"}
