{"statement": "The interpretation of the cellular co-localization of the biotin-biguanide conjugate with TOMM20 as mitochondrial 'accumulation' of the conjugate is overstated because it cannot exclude binding of the conjugate to the mitochondrial membrane.", "type": "weakness", "axis": "soundness", "severity": "major"}
{"statement": "It would strengthen the research plan if additional incubations with the biotin-biguanide conjugate in combination with metformin had shown that metformin is competitive with the biotin-conjugate.", "type": "weakness", "axis": "soundness", "severity": "major"}
{"statement": "The methodology does not state the minimum number of peptides that would be used for the identification of proteins in the mass spectrometry analysis following pull-down experiments.", "type": "weakness", "axis": "soundness", "severity": "minor"}
{"statement": "The validation of ATP5I was based on the use of recombinant protein (which was 90% pure) for the SPR and the use of a single antibody to ATP5I, and the validity of the immunoblotting rests on the assumption that there is no 'non-specific' immunoactivity in the relevant mol wt range.", "type": "weakness", "axis": "soundness", "severity": "major"}
{"statement": "Information on the validation of the ATP5I antibody would be helpful.", "type": "weakness", "axis": "soundness", "severity": "minor"}
{"statement": "The measurements of oxygen consumption rate (OCR) and extracellular acidification rate (ECAR) are conducted by a single injection of a biguanide, followed over time and presented as fold change, which causes the individual information on the effect of metformin and derivate on control and KO cells to be lost.", "type": "weakness", "axis": "soundness", "severity": "major"}
{"statement": "The usual measurement of OCR should be coupled with certain inhibitors and uncouplers, such as oligomycin, FCCP, and Antimycin A/rotenone, to understand the contribution of individual complexes to respiration, which would be informative since biguanides and ATP5I KO affect protein levels of components of complex I and IV.", "type": "weakness", "axis": "soundness", "severity": "major"}
{"statement": "To further strengthen the data, it would be helpful to obtain measurements of actual ATP levels in these cells, as this would explain the activation of AMPK.", "type": "weakness", "axis": "soundness", "severity": "major"}
{"statement": "The alterations in mitochondrial morphology upon ATP5I KO are measured by subjective quantifications of filamentous versus puncta structures, whereas Fiji offers great tools to quantify the mitochondrial network unbiasedly and with more accuracy using deconvolution and skeletonization of the mitochondria.", "type": "weakness", "axis": "soundness", "severity": "minor"}
{"statement": "The rationale for the use of such a high concentration of metformin (16mM, which is ~2 orders of magnitude higher than therapeutic concentrations) has not been explained, and this concentration is likely linked to compromised energy status.", "type": "weakness", "axis": "soundness", "severity": "major"}
{"statement": "Validation of the cellular ATP status and NAD/NADH with metformin as compared with the two inhibitors could help the interpretation of this data.", "type": "weakness", "axis": "soundness", "severity": "minor"}
