{"statement": "The choice to block AMPAR with NBQX is unconventional and needs to be better justified as both investigated homeostatic mechanisms (synaptic scaling and structural plasticity) are known to be AMPAR dependent.", "type": "weakness", "axis": "soundness", "severity": "major"}
{"statement": "The experimental approach would have benefited from having an actual timeline of structural changes throughout the three days of AMPAR inhibition using time-lapse imaging, especially as the experimental model allows it, which would have provided additional information on spine dynamics and on the respective timescale of the structural and functional changes.", "type": "weakness", "axis": "soundness", "severity": "minor"}
{"statement": "The computational model would have been strengthened by an experimental dataset with homeostatic plasticity induced by higher activity (e.g. with bicuculline), as there is currently no data on structural plasticity following scaling down, and scaling up and down are mediated by different molecular pathways.", "type": "weakness", "axis": "soundness", "severity": "minor"}
{"statement": "The research plan presents a very specific definition and distinction of structural and functional homeostatic plasticity, limiting structural plasticity to spine density and functional plasticity to synaptic scaling, which allows discussion of the interplay between distinct 'synapse number-based structural plasticity' and 'synaptic weight-based synaptic scaling'.", "type": "strength", "axis": "contribution", "severity": "minor"}
{"statement": "The computational framework appears to bypass the fact that spine size regulates the space available for AMPARs at the synapse and thus synaptic weight, as spine size does not seem to be taken into account in the network simulations, which present synaptic scaling and structural plasticity as completely distinct processes.", "type": "weakness", "axis": "soundness", "severity": "major"}
{"statement": "The stringent distinction between structural and functional plasticity and the reasons behind this choice should be made more explicit in the research plan, as a less stringent distinction would benefit the model's biological realism.", "type": "weakness", "axis": "soundness", "severity": "minor"}
{"statement": "the combination of experiments and simulations is a promising approach to investigating network self-organization. The gradual blocking of activity is especially valuable to inform mathematical models and distinguish them from alternatives.", "type": "strength", "axis": "contribution", "severity": "major"} 
{"statement": "a valuable contribution to discerning the mathematical shape of a homeostatic structural plasticity model and understanding the necessity of synaptic scaling in the same network.", "type": "strength", "axis": "contribution", "severity": "minor"} 