{"statement": "One major caveat of the study is that different neuromodulators are strongly correlated across all time scales and related to this, the authors need to discuss this point further and provide more evidence from the literature (if any) that suggests similar ultra-slow oscillations are weaker or lack from similar signals recorded for other neuromodulators such as Ach and NA.", "type": "weakness", "axis": "soundness", "severity": "major"}
{"statement": "A major question that has been left out from the study and discussion is how the same level of serotonin before and after the peak could be differentially related to the opposite observed phenomenon. What are the possible parallel mechanisms for distinguishing between the rising and falling phases? Any neurophysiological evidence for sensing the direction of change in serotonin concentration (or any other neuromodulator), and is there any physiological functionality for such mechanisms?", "type": "weakness", "axis": "soundness", "severity": "major"}
{"statement": "5-HT levels and electrophysiological recordings were obtained from opposite hemispheres due to technical limitations. Ipsilateral simultaneous recordings may show more direct relationships.", "type": "weakness", "axis": "soundness", "severity": "minor"}
{"statement": "The number of mice used in the experiments is relatively small (n=6). Validation with a larger sample size would be desirable.", "type": "weakness", "axis": "soundness", "severity": "minor"}
{"statement": "The study focuses primarily on sleep and quiet wakefulness. Investigation of 5-HT oscillations during a wider range of behavioral states (e.g., exploratory behavior, learning tasks) may provide a more complete understanding.", "type": "weakness", "axis": "contribution", "severity": "minor"}
{"statement": "The study focuses on the CA1 region of the hippocampus. It's unclear whether similar 5-HT oscillation patterns exist in other brain regions.", "type": "weakness", "axis": "contribution", "severity": "minor"}
{"statement": "The temporal resolution and sensitivity of the GRAB5-HT3.0 sensor may not capture faster 5-HT dynamics.", "type": "weakness", "axis": "soundness", "severity": "minor"}
{"statement": "The study does not explore interactions with other neuromodulators (e.g., norepinephrine, acetylcholine) or their potential ultraslow oscillations.", "type": "weakness", "axis": "contribution", "severity": "minor"}
{"statement": "The hypothesis of the relation between a specific time scale and one certain neuromodulator (5-HT in this manuscript) could have a significant impact on the understanding of the hierarchy in the temporal scales of neural activity.", "type": "strength", "axis": "contribution", "severity": "major"}
{"statement": "The study makes compelling use of the state-of-the-art methodology to address its aims: the genetically encoded 5-HT sensor used in the study is ideal for capturing the ultraslow 5-HT dynamics.", "type": "strength", "axis": "soundness", "severity": "major"}

