{"statement": "The research plan suggests that sensory responses are noisy at the level of neurons, but that population activity is reliable and that different neurons may participate in sensory coding on different trials, however no analysis related to single trial variance or overall stability of population coding is provided in the methodology.", "type": "weakness", "axis": "soundness", "severity": "major"}
{"statement": "Showing that population activity is stable across trials in terms of total activity level or in some latent low dimensional representation would be required to support the concept of homeostatic balancing proposed in the research plan.", "type": "weakness", "axis": "soundness", "severity": "minor"}
{"statement": "The rebalancing hypothesis would predict either that the responses of stimulated neurons would remain A) elevated after stimulation due to a hebbian mechanism or B) suppressed due to high activity levels on previous trials, a homeostatic mechanism, but better justification is needed for the spatial pattern of neurons that were chosen for stimulation.", "type": "weakness", "axis": "soundness", "severity": "minor"}
{"statement": "The use of CRmine together with GCaMP8s has been reported as problematic as the 2Ph excitation of GCaMP8s also excites the opsin, and while the research plan uses a red-shifted version of CRmine to prevent such cross excitation by the imaging laser, they should explain how they controlled for the absence of rsCRmine activation by the 940nm light.", "type": "weakness", "axis": "soundness", "severity": "major"}
{"statement": "Showing the fluorescence traces immediately after the onset of the imaging session would ensure that neurons are not excited as they are imaged when using the proposed AAV9-hSyn-GCaMP8s-T2A-rsChRmine vector.", "type": "weakness", "axis": "soundness", "severity": "minor"}
{"statement": "This would be problematic in the study as the tuning of out-of-focus activated cells may be unrelated to the tuning of the targeted cells, and to control for such an effect, one could in principle decouple the imaging and the excitation planes, and check for the absence of out-of-focus unwanted excitation.", "type": "weakness", "axis": "soundness", "severity": "major"}
{"statement": "As the holographic pattern of light could produce out-of-focus hot spots absent in the single cell control experiments, we don't know what is the extent of the contamination from non-targeted cells in the proposed multi-cell stimulation approach.", "type": "weakness", "axis": "soundness", "severity": "major"}
{"statement": "A strength of this study comes from the design of the experimental protocol used to compare the activity in non-target co-tuned cells when the optogenetic stimulation is paired with their preferred tone versus a non-preferred pure tone.", "type": "strength", "axis": "soundness", "severity": "major"}
{"statement": "The methodology appropriately addresses the difficulty of distinguishing between the rebalancing process and the adaptation to repeated auditory stimuli by using a comparison with a control condition similar to the optogenetic stimulation conditions, except that the laser power is kept at 0 mW.", "type": "strength", "axis": "soundness", "severity": "major"}
{"statement": "The method used to quantify spatial distribution calculates the minimum distance of a non-target cell to any target cell, but this quantification doesn't exclude the possibility that non-target cells in the minimum distance range could also be close and connected to the other 4 target cells, thus masking any inhibitory effect mediated by the closest target cell.", "type": "weakness", "axis": "soundness", "severity": "minor"}
{"statement": "The authors should provide a quantitative estimate of the range of local inhibition in layers 2/3 of the mouse auditory cortex to compare with the range of distances examined in this study (< 300 µm).", "type": "weakness", "axis": "soundness", "severity": "minor"}
{"statement": "The study is based on a technologically very solid approach based on single-cell resolution two-photon optogenetics.", "type": "strength", "axis": "soundness", "severity": "major"}
