{"statement": "The research plan spends a good amount of space discussing how the six datasets have different distributions in abundance scores, but after the development of their model there is more to say about why and whether something can be leveraged here to design maximally informative experiments.", "type": "weakness", "axis": "contribution", "severity": "minor"}
{"statement": "Their planned direct head-to-head comparison between their substitution matrices and Rosetta ΔΔG predictions is underdeveloped and lacks analysis of how this comparison can be used to dissect cases where thermodynamics are not contributing to specific substitution patterns or in specific residues/regions that are predicted by one method better than the other.", "type": "weakness", "axis": "soundness", "severity": "major"}
{"statement": "Perhaps beyond the scope of this baseline method, there is also ThermoMPNN and the work from Gabe Rocklin to consider as other approaches that should be more correlated only with thermodynamics.", "type": "weakness", "axis": "soundness", "severity": "minor"}
{"statement": "The research plan focuses on a single molecular phenotype (abundance) measured using the same experimental approach (VAMP-seq), avoiding confounding factors present when combining data from different phenotypes (e.g., mixing stability, activity, and fitness data) or different experimental methods.", "type": "strength", "axis": "soundness", "severity": "minor"}
{"statement": "The mechanistic connection between stability and abundance is assumed rather than attempted to be explained or investigated, as destabilizing mutations might decrease abundance through protein quality control, but other mechanisms like degron exposure could also be at play.", "type": "weakness", "axis": "soundness", "severity": "major"}
{"statement": "The pooling of data across proteins to construct the matrices needs better justification, given the observed differences in score distributions between proteins such as PTEN's distribution being shifted towards high abundance scores while ASPA and PRKN show more binary distributions.", "type": "weakness", "axis": "soundness", "severity": "major"}
{"statement": "Some key methodological choices require better justification, such as combining 'to' and 'from' mutation profiles for PCA despite their different behaviors, or using arbitrary thresholds like 0.05 for residue classification.", "type": "weakness", "axis": "soundness", "severity": "minor"}
{"statement": "A wider discussion of the possible reasons why matrices for certain proteins seem to correlate better than others would be extremely interesting, touching upon possible points like differences or similarities in local environments, degradation pathways, post-translation modifications, and regulation.", "type": "weakness", "axis": "contribution", "severity": "minor"}
{"statement": "The research plan should explore whether on top of the buried vs exposed paradigm, another grouping dimension at the protein/domain level could improve performance.", "type": "weakness", "axis": "contribution", "severity": "minor"}
