{"statement": "The study does not include a neutral cue condition where the cue width spans 360°, which could serve as a valuable baseline for assessing the BOLD response enhancements and diminishments in both attended and non-attended areas.", "type": "weakness", "axis": "soundness", "severity": "minor"}
{"statement": "The explicit reasoning for the chosen letter-to-number ratios for various cue widths is not detailed, and ensuring clarity on these ratios is crucial as it affects the task difficulty and the comparability of behavioral performance across different cue widths.", "type": "weakness", "axis": "soundness", "severity": "major"}
{"statement": "Task difficulty seems to vary as a function of spatial scope of attention, with varying ratios of letters/digits across spatial scope conditions, which may complicate interpretations of neural modulation results since observed differences in behavior and BOLD signals should be attributable solely to changes in cue width and not confounded by variations in task difficulty.", "type": "weakness", "axis": "soundness", "severity": "major"}
{"statement": "Some aspects of analysis and data sorting are unclear, such as how voxels are selected for analyses beyond the constraint to voxels whose population receptive fields overlap with the stimulus display.", "type": "weakness", "axis": "soundness", "severity": "minor"}
{"statement": "While the focus of this research plan is on modulations of visual cortex responses due to attention in early visual areas V1-V3, the lack of inclusion of results from other retinotopic areas such as V3AB, hV4, and IPS regions like IPS0/1 is a weakness.", "type": "weakness", "axis": "contribution", "severity": "minor"}
{"statement": "The purpose of the temporal interval analysis examining model performance across different temporal intervals (1, 2, 3, 5, or 10 TRs) is rather unclear, though it presumably relates to determining how much data is needed to recover the cortical modulation and hence how dynamic a signal the method can capture.", "type": "weakness", "axis": "soundness", "severity": "minor"}
{"statement": "The development of a new approach to estimate the spatial tuning of the attentional field is a significant strength of this study. It provides a fresh perspective on how spatial attention modulates visual perception.", "type": "strength", "axis": "contribution", "severity": "major"}
{"statement": "The use of fMRI to track the spatial tuning of the attentional field across different visual regions is methodologically rigorous and provides valuable insights into the neural mechanisms underlying attentional modulation.", "type": "strength", "axis": "soundness", "severity": "major"}
{"statement": "Well-designed manipulations (changing location and scope of spatial attention), and careful retinotopic/pRF mapping, allow for a robust assay of the spatial profile of attentional enhancement, which has not been carefully measured in previous studies.", "type": "strength", "axis": "soundness", "severity": "major"}
{"statement": "Model-fitting to characterize spatial scope of enhancement improves interpretability of findings.", "type": "strength", "axis": "soundness", "severity": "minor"}
