{"statement": "The research topic is fascinating, and very few labs in the world are asking the question of how time is represented in the human brain.", "type": "strength", "axis": "contribution", "severity": "major"}
{"statement": "The topic of egocentric vs. allocentric processing has been relatively under-investigated with respect to time, having traditionally been studied in the domain of space, making the current study timely and potentially important for understanding how time is represented in the brain in the service of memory.", "type": "strength", "axis": "contribution", "severity": "major"}
{"statement": "The study is well thought out, and the behavioural paradigm is a creative approach to tackling the research question of how time is represented from different perspectives.", "type": "strength", "axis": "soundness", "severity": "major"}
{"statement": "A particular strength is the implementation of an imagination phase for participants while learning the fictional religious ritual, which moves the paradigm beyond semantic/schema learning and is probably the best approach besides asking participants to arduously enact and learn the different events with their exact timings in person.", "type": "strength", "axis": "soundness", "severity": "major"}
{"statement": "The external-perspective task (same/different recognition) and internal-perspective task (temporal order) are radically different and do not require the same operationalization, requiring a comprehensive comparison of task requirements, their operationalization, and assessment of behavioral biases inherent to each task that may confound brain activity observed with fMRI.", "type": "weakness", "axis": "soundness", "severity": "major"}
{"statement": "The authors do not comment on the obvious differences in task difficulty between the external-perspective and internal-perspective tasks, which demonstrates a substantial lack of control in the experimental design.", "type": "weakness", "axis": "soundness", "severity": "major"}
{"statement": "The same/different task (external-perspective) comes with known biases in psychophysics that are not present in the temporal order task (internal-perspective), and the authors did not discuss or try to match the performance level in these two tasks.", "type": "weakness", "axis": "soundness", "severity": "major"}
{"statement": "It is unclear whether the number of traversed context boundaries (i.e., between morning-afternoon, and afternoon-evening) was controlled for across sequential length in the internal perspective condition.", "type": "weakness", "axis": "soundness", "severity": "minor"}
{"statement": "The decision to model task trials as stick functions with duration 0 in the GLMs, as opposed to boxcar functions with varying durations, needs further justification given the potential benefits of the latter approach.", "type": "weakness", "axis": "soundness", "severity": "minor"}
