{"statement": "The work is of great interest and the experiments are of very good quality.", "type": "strength", "axis": "contribution", "severity": "major"}
{"statement": "the authors need to check some additional proteins as controls. One good candidate could be RhoA, considering the authors say it is activated by S1PR2 and not by S1PR1.", "type": "weakness", "axis": "soundness", "severity": "minor"}
{"statement": "The authors should also show that the number of neurons is not grossly different between susceptible and unsusceptible mice by staining for NeuN or performing a western blot for a neuronal-specific protein (e.g. Map2 or beta3-tubulin).", "type": "weakness", "axis": "soundness", "severity": "minor"}
{"statement": "The authors should also evaluate the levels of activated RAC1 and activated Cdc42, which are much more important than just basal levels of the proteins to infer an effect on actin dynamics through kits that use specific adaptors to pulldown GTP-Rac1 and GTP-Cdc42.", "type": "weakness", "axis": "soundness", "severity": "major"}
{"statement": "The experiment is performed in an immortalised cell line but needs to be performed at least in primary hippocampal neurons.", "type": "weakness", "axis": "soundness", "severity": "major"}
{"statement": "the authors use a Yeast two-hybrid system, but the system is not often used when probing the interaction between transmembrane proteins and should include other transmembrane proteins as negative controls.", "type": "weakness", "axis": "soundness", "severity": "major"}
{"statement": "The authors could perform immunoprecipitation in heterologous cells overexpressing S1PR1 and ITGA2 or a Proximity ligation assay in primary hippocampal neurons using antibodies against S1PR1 and ITGA2 to better demonstrate their interaction.", "type": "weakness", "axis": "soundness", "severity": "minor"}
{"statement": "To conclusively demonstrate that S1PR1 and ITGA2 participate in the same pathway, the authors could show that knocking down the two proteins at the same time does not have additive effects on behavioral tests compared to the knockdown of each one of them in isolation.", "type": "weakness", "axis": "soundness", "severity": "minor"}
{"statement": "It would be interesting to check S1PR2 levels as a control in CCI-chronic animals.", "type": "weakness", "axis": "soundness", "severity": "minor"}
{"statement": "The N for Sham is around 8 whereas is around 20 for CCI animals in the chronic pain experiments, and the same number of Sham animals should be used for proper comparison.", "type": "weakness", "axis": "soundness", "severity": "minor"}
{"statement": "The authors should check if there is brain inflammation in CCI chronic animals by examining astrocytes and microglia.", "type": "weakness", "axis": "soundness", "severity": "minor"}
{"statement": "If increased brain inflammation is found, it would be interesting for the authors to check whether a prolonged anti-inflammatory treatment in CCI animals administered before the insurgence of memory impairment could stop it from happening.", "type": "weakness", "axis": "soundness", "severity": "minor"}
{"statement": "The categorization of mice into 'susceptible' and 'unsusceptible' groups based on memory performance using k-means clustering requires further validation, and the reliance on a single animal model may limit the generalizability of the findings.", "type": "weakness", "axis": "soundness", "severity": "major"}
{"statement": "The study could benefit from a more detailed exploration of the impact of different types of pain on memory impairment.", "type": "weakness", "axis": "contribution", "severity": "minor"}
{"statement": "The protocol for behavioral testing should be clarified and the potential for learning or stress effects should be addressed.", "type": "weakness", "axis": "soundness", "severity": "minor"}
{"statement": "The effective drug thresholds and potential non-specific effects of pharmacological interventions should be discussed in more detail.", "type": "weakness", "axis": "soundness", "severity": "minor"}
