{"statement": "The potential importance of ssDNA generation in the experiments has not been considered, as 3mC modification from MMS exposure is highly specific to single stranded DNA occurring at ~20,000 times the rate as double stranded DNA, and the introduction of DNMTs is expected to introduce many methylation adducts genome-wide that will generate single stranded DNA tracts when repaired in an AlkB deficient background.", "type": "weakness", "axis": "soundness", "severity": "major"}
{"statement": "The plan emphasizes the non-additivity of combining MMS, DNMT, and AlkB, yet the underlying reasoning seems essentially additive: it assumes MMS and DNMT introduce similar forms of damage that AlkB simply removes. Conceptually, this framing overlooks that a non-additive pattern would be more consistent with the ssDNA model, raising concerns about whether the idea adequately captures the mechanistic distinctions it aims to address.", "type": "weakness", "axis": "soundness", "severity": "major"}
{"statement": "The linearity of MMS (and H2O2) exposure to survival could be directly tested with a dilution series of MMS (H2O2) to address whether survival to DNA methylation rate is non-linear over the range of the experiment.", "type": "weakness", "axis": "soundness", "severity": "minor"}
{"statement": "The idea of introducing DNMT to study methylation raises concerns, since it risks inducing substantial transcriptional changes. Conceptually, this suggests that the approach may be inherently more confounded than it initially appears, making it unclear whether the idea can isolate the intended effects of ectopic methylation in such a complex system.", "type": "weakness", "axis": "soundness", "severity": "major"}
{"statement": "Since such a study in eukaryotes would be complicated by DNA methylation controlling gene regulation, the plan cleverly utilize Escherichia coli (E.coli) and incorporate into it the DNMTs from other bacteria that methylate the cytosines of DNA in a CpG context like that observed in eukaryotes.", "type": "strength", "axis": "soundness", "severity": "minor"}
{"statement": "It would be important to know whether the increased sensitivity (toxicity) to DNMT expression and MMS is also accompanied by substantial increases in mutagenicity, and the authors should aim to explain why mutation frequencies were not also measured in these experiments.", "type": "weakness", "axis": "soundness", "severity": "minor"}
