{"statement": "This is an elegant approach but the power of isobaric mass tags is not fully leveraged in the current research plan.", "type": "weakness", "axis": "contribution", "severity": "major"}
{"statement": "Only Q2linkers (C1q2 and C2q2) are used in the proposed experiments, which means only two conditions can be compared, limiting the competitiveness against other crosslinking quantitation strategies.", "type": "weakness", "axis": "contribution", "severity": "major"}
{"statement": "A Q5linker would be a really useful crosslinker that would open up comprehensive quantitative XLMS studies, but is not explored in this research plan.", "type": "weakness", "axis": "contribution", "severity": "major"}
{"statement": "The true power of isobaric labeling, accurate quantitation across multiple samples in a single run, is not fully exploited in the proposed experiments.", "type": "weakness", "axis": "contribution", "severity": "major"}
{"statement": "The research plan should investigate Qlinker quantitation of MBP incubated with different concentrations of maltose or Calmodulin incubated with different concentrations of CBPs to determine if quantitation matches ratios predicted using known binding constants or conformational state populations.", "type": "weakness", "axis": "soundness", "severity": "major"}
{"statement": "The research plan does not address whether it is possible to extract ratios of protein populations in different conformations, assembly, or ligand-bound states.", "type": "weakness", "axis": "soundness", "severity": "major"}
{"statement": "It would be interesting to evaluate modification efficiency of the isobaric crosslinker in a denatured sample (as an upper limit where all lysines should be accessible) and then also in a native sample, but this is not included in the experimental design.", "type": "weakness", "axis": "soundness", "severity": "minor"}
{"statement": "The research plan is missing reference to a potential qCLMS gold standard dataset or comparison with label-free qCLMS for one of the proposed experiments, such as the differential biosensor experiments.", "type": "weakness", "axis": "soundness", "severity": "major"}
