{"statement": "This is an exploratory study that doesn't explore quite enough.", "type": "weakness", "axis": "contribution", "severity": "major"}
{"statement": "The authors make a point of exploring that neuronal firing properties vary across cell types, but only use baseline firing rate as a proxy metric for cell type.", "type": "weakness", "axis": "soundness", "severity": "major"}
{"statement": "The research plan does not address whether waveform shape features, which can also be informative of cell type, predict the effect of stimulation.", "type": "weakness", "axis": "contribution", "severity": "minor"}
{"statement": "The methodology does not examine whether the autocorrelation of spike timing, which can be informative about temporal dynamics, is altered by stimulation.", "type": "weakness", "axis": "contribution", "severity": "minor"}
{"statement": "The authors reference the relevance of spike-field synchrony (30-55 Hz) in animal work, but ignore it in their proposed methodology.", "type": "weakness", "axis": "soundness", "severity": "major"}
{"statement": "The research plan does not address whether spike-field synchrony changes in the 30-55 Hz frequency range when comparing image presentation to post-stimulation periods.", "type": "weakness", "axis": "contribution", "severity": "minor"}
{"statement": "The methodology does not examine how multi-unit activity responds to stimulation.", "type": "weakness", "axis": "contribution", "severity": "minor"}
{"statement": "At the somewhat low count of neurons (total n=156 included) it would be valuable to provide input on multi-unit responses to stimulation as well.", "type": "weakness", "axis": "soundness", "severity": "minor"}
{"statement": "Several intracranial studies have implicated proximity to white matter in determining the effects of stimulation on LFPs, but the research plan does not address whether there is an effect of white matter proximity on neuronal responses.", "type": "weakness", "axis": "soundness", "severity": "minor"}
{"statement": "It is not clear why the assessment of firing rates after image onset and after stimulation offset is limited to one second - this choice should be more theoretically justified, particularly for regions that spike as sparsely as the basolateral amygdala and connected structures.", "type": "weakness", "axis": "soundness", "severity": "minor"}
