{"statement": "The individual-based simulation model is interesting and builds in valuable complexity to explore the interaction of life history and social traits in vertebrate division of labor.", "type": "strength", "axis": "soundness", "severity": "minor"}
{"statement": "The asexual reproduction with small mutations assumption is fairly strong and seems to bias the model outcomes in a particular way.", "type": "weakness", "axis": "soundness", "severity": "major"}
{"statement": "The authors appropriately measured relatedness within groups and eliminated it with an ingenious swapping-out-subordinates procedure.", "type": "strength", "axis": "soundness", "severity": "minor"}
{"statement": "Unless relatedness is eliminated completely, average relatedness will be very high by design, making the relatedness measurement somewhat moot when most groups have no subordinates.", "type": "weakness", "axis": "soundness", "severity": "minor"}
{"statement": "The convoluted way the research plan creates an incentive for division of labor is difficult to understand when simpler alternatives like a law of minimum or separating work help effects on fecundity from defense help effects on offspring survival would be more intuitive.", "type": "weakness", "axis": "soundness", "severity": "major"}
{"statement": "The proposed model only makes a single type of help marginally less beneficial if done more than the other, which represents fairly weak selection for division of labor that is hard to justify.", "type": "weakness", "axis": "soundness", "severity": "major"}
{"statement": "The model makes unrealistic assumptions that restrict the possibility that kin selection leads to the evolution of helping by assuming subordinates can only help breeders in the absence of group augmentation, whereas in real organisms subordinates can help other subordinates and increase survival of non-breeders even without group augmentation.", "type": "weakness", "axis": "soundness", "severity": "major"}
{"statement": "The restrictions on kin selection artificially limit its ability to lead to the evolution of helping and potentially division of labor, making the conclusion that group augmentation is the primary driving factor appear forced by the imposed model constraints.", "type": "weakness", "axis": "contribution", "severity": "major"}
{"statement": "The model used is quite particular, so the claimed generality across vertebrates is not warranted.", "type": "weakness", "axis": "contribution", "severity": "major"}
