{"statement": "It is unclear what the authors want to do in their research plan, making the main objectives and approach difficult to follow.", "type": "weakness", "axis": "contribution", "severity": "major"}
{"statement": "The plan claims without justification that additive partitioning of net biodiversity effects is flawed and theoretically and biologically meaningless.", "type": "weakness", "axis": "soundness", "severity": "minor"}
{"statement": "The proposed method for calculating species-level overyielding as a competitive growth response is based on the unrealistic assumption that resource uptake is fully converted into biomass, excluding other investments like allelopathic chemical production.", "type": "weakness", "axis": "soundness", "severity": "major"}
{"statement": "It is unclear from the experimental design whether partial-density monocultures should be planted or simply calculated from full-density monocultures, and at what time monocultures should be evaluated.", "type": "weakness", "axis": "soundness", "severity": "minor"}
{"statement": "The ideal case of only resource competition playing a role is unrealistic as it excludes enemies, differential conversion factors of resources into biomass, and antagonistic or facilitative effects.", "type": "weakness", "axis": "soundness", "severity": "major"}
{"statement": "Because there are so many potential reasons for deviations from the null model of only resource competition, a deviation from the null model does not allow conclusions about underlying mechanisms.", "type": "weakness", "axis": "soundness", "severity": "major"}
{"statement": "The competitive partitioning model is not a systematically developed partitioning method but rather an empirical ad hoc formulation that approximates competitive effects.", "type": "weakness", "axis": "soundness", "severity": "major"}
{"statement": "Using a simplistic simulation with the GYPSY growth and yield simulation system to test the method is insufficient for validation.", "type": "weakness", "axis": "soundness", "severity": "major"}
{"statement": "The simulation design does not include mechanisms that could create complementarity effects in additive partitioning if all species would have the same monoculture yield, nor does it include mechanisms of enemies or antagonistic interactions.", "type": "weakness", "axis": "soundness", "severity": "minor"}
{"statement": "The assumption that competitive interactions are the predominant type of interspecific relationships in plants and the focus on competitive dominance rests on the problematic assumption that there is only one mode of competition when two species use the same resources.", "type": "weakness", "axis": "soundness", "severity": "major"}
{"statement": "The partial density monoculture approach has timing dependency issues, as the competitive ability values will heavily depend on timing and the relationship between maximum initial growth rates and competitive abilities at high stand densities.", "type": "weakness", "axis": "soundness", "severity": "minor"}
{"statement": "The definition of competitive ability seems wrong because a species can be more productive simply by having a broader niche space that it exploits, rather than through competitive dominance.", "type": "weakness", "axis": "soundness", "severity": "major"}
{"statement": "The mathematical form of standardizing relative competitive ability by the community maximum makes the scaling dependent on a single value, which is problematic.", "type": "weakness", "axis": "soundness", "severity": "minor"}
{"statement": "The proposed competitive partitioning method is much less systematic than the additive partitioning method because the other term is simply calculated as the difference.", "type": "weakness", "axis": "soundness", "severity": "minor"}
{"statement": "The justification for calculating maximum competitive growth responses and relative competitive ability does not follow the strict assumptions of what competition in the absence of complementarity actually represents.", "type": "weakness", "axis": "soundness", "severity": "major"}
{"statement": "The partial density treatment does not isolate competition as indicated in the methodology, since all interactions including negative feedback from species-specific pests and pathogens are density-dependent.", "type": "weakness", "axis": "soundness", "severity": "major"}
{"statement": "The research plan relies heavily on simulations while claiming that current experiments cannot test these ideas due to replacement series designs, but dozens of experiments exist where replacement series were repeated at multiple densities that would allow direct testing.", "type": "weakness", "axis": "contribution", "severity": "major"}
