{"statement": "The study provides 17 years of longitudinal data in the same setting, following the same individuals, which provides a window into long-term changes in the behavior of wild chimpanzees that cannot be understood through cross-sectional comparisons.", "type": "strength", "axis": "soundness", "severity": "major"}
{"statement": "Using stone tool use, a cognitively demanding behavior, to understand the aging process makes a foray into a neglected topic of research: the impact of the physiological and cognitive changes due to senescence on stone tool use in chimpanzees.", "type": "strength", "axis": "contribution", "severity": "major"}
{"statement": "The metrics of 'efficiency' are suitable for measuring changes in technological behavior over time, as specifically tailored to the nut-cracking (e.g., time, number of actions, number of strikes, tool changes).", "type": "strength", "axis": "soundness", "severity": "minor"}
{"statement": "The ethogram and the coding protocol are suitable for studying the target questions and objectives.", "type": "strength", "axis": "soundness", "severity": "minor"}
{"statement": "One of the main limitations of this study is the small sample size with only 5 of the old-aged individuals, which is not enough to draw any inferences about aging for chimpanzees more generally.", "type": "weakness", "axis": "soundness", "severity": "major"}
{"statement": "The research plan studies data from only five of the 17 years of recorded data at Bossou, and the selection of this subset of data requires clarification: why were these intervals chosen, why this number of data points, and how do we know that it provides a representative picture of the age-related changes of the full 17 years.", "type": "weakness", "axis": "soundness", "severity": "major"}
{"statement": "There is a lack of comparison of the stone tool use behavior with younger individuals in the same period for most variables, to check if the changes observed are only related to age or if it is an overall variance, with the comparison with younger chimpanzees only done for one of the variables (attendance).", "type": "weakness", "axis": "soundness", "severity": "major"}
{"statement": "With measuring and interpreting the 'efficiency' of behaviors, there are in-built assumptions about the goals of the agents and how we can define efficiency, as efficiency may not be an intentional goal for nut-cracking at all, and what is 'efficient' for the human observer might not be efficient for the chimpanzee performing the behavior.", "type": "weakness", "axis": "soundness", "severity": "minor"}
{"statement": "For the study of the physiological impact of senescence of tool use on strength and coordination, the research plan would benefit from the inclusion of variables like grip type and approximate stone size, as the size and shape of stones for nut-cracking have been shown to influence the efficacy and 'efficiency' of tool use.", "type": "weakness", "axis": "soundness", "severity": "minor"}
{"statement": "Inter- and intraspecific variation in the properties of nuts being processed is a potential confound that is not planned to be evaluated, as if oil palm nuts were varying year-to-year, this would theoretically have an effect on the behavioral forms and strategies employed by the chimpanzees.", "type": "weakness", "axis": "soundness", "severity": "minor"}
{"statement": "It is perplexing that the research plan analyzes only one year where the coula nuts were provided at the test site, but these were provided during multiple field seasons, and it would be more useful to compare data from a similar number of field seasons with both species to study age-related changes in nut processing over time.", "type": "weakness", "axis": "soundness", "severity": "minor"}
{"statement": "Both individual personality (especially neophilia versus neophobia) and motivation factors are confounds that can contribute to a more valid interpretation of the patterns found but are not considered in the research plan.", "type": "weakness", "axis": "soundness", "severity": "minor"}
{"statement": "To draw any conclusions about age-related changes in diet and food preferences, data on the overall food intake/preferences of the individuals and the food availability in the home range would be needed.", "type": "weakness", "axis": "soundness", "severity": "minor"}
{"statement": "Generally speaking, there is a lack of consideration for temporal variation in ecological factors in the research plan.", "type": "weakness", "axis": "soundness", "severity": "minor"}
