{"statement": "The control condition defined as 'no expectation' or 'no prediction' is problematic because it is difficult to conceive that participants would not have any expectations or predictions, and since this control condition was not part of the initial conditioning, participants had no reference to previous stimuli", "type": "weakness", "axis": "soundness", "severity": "major"}
{"statement": "The authors' choice of having 3 groups of positive, negative, and 'neutral' expectations in their sham Brain-Computer Interface paradigm is to be praised.", "type": "strength", "axis": "soundness", "severity": "minor"}
{"statement": "The manipulation of expectations by telling participants that objective intensities were held constant but that EEG recordings could predict whether they would perceive the stimulus as more or less intense is an interesting approach, but there could have been more justification in the introduction for why the authors have chosen this unusual procedure.", "type": "weakness", "axis": "soundness", "severity": "minor"}
{"statement": "The introduction mentions that little is known about potential cerebral differences between expectations of high vs. low pain expectations, but the fear conditioning literature could be cited here, as activations in ACC, SMA, Ins, parahippocampal gyrus, PAG are often associated with upcoming threat, whereas activations vmPFC/default mode network are associated with safety.", "type": "weakness", "axis": "contribution", "severity": "minor"}
{"statement": "The sequence of analyses that starts by identifying an fMRI signal of interest and then attempts to find its EEG correlates is problematic because the low temporal resolution of fMRI makes it difficult to differentiate expectation from perception, which doesn't make this analysis a good starting point.", "type": "weakness", "axis": "soundness", "severity": "major"}
{"statement": "The hypotheses on 'valenced' vs. 'absolute' effects are difficult to follow because the 'neutral' condition is not really neutral since participants know the temperature is always the same, so if they are told that the machine cannot predict whether their perception is going to be low or high, then it must be because it is likely to be in between, meaning the neutral condition is not 'devoid' of expectations as the authors suggest.", "type": "weakness", "axis": "soundness", "severity": "major"}
