{"statement": "Attempting to better understand the contribution of different striatal subregions to sensory discrimination learning strikes me as a highly relevant and timely question.", "type": "strength", "axis": "contribution", "severity": "major"}
{"statement": "The authors have set up a robust behavioral task and systematically tackled the question about a striatal role in learning with multiple observational and manipulative techniques.", "type": "strength", "axis": "soundness", "severity": "major"}
{"statement": "The structured approach the authors take by using neuroimaging to inform their pharmacological manipulation experiments and electrophysiological recordings is a strength.", "type": "strength", "axis": "soundness", "severity": "major"}
{"statement": "The authors have rigorously used PET neuroimaging, which is an interesting non-invasive method to track brain activity during behavioral states.", "type": "strength", "axis": "soundness", "severity": "minor"}
{"statement": "In the case of a freely moving behavior where the 18F-FDG-PET scans are performed ~30 minutes after the behavioral task, it is unclear what conclusions can be drawn about task-specific brain activity.", "type": "weakness", "axis": "soundness", "severity": "major"}
{"statement": "In commenting on the unilateral shifts in brain striatal activity during behavior, the authors use the single lever task as a control, where many variables affecting neuronal activity might be different than in the discriminatory task.", "type": "weakness", "axis": "soundness", "severity": "minor"}
{"statement": "The study might be better served using Day 2 measurements as a control against which to compare activity of all other sessions since the task structures are similar.", "type": "weakness", "axis": "soundness", "severity": "minor"}
{"statement": "To further address whether this difference arises from the task contingency, and not from the frequency representation of the pVLS, an important control would be to switch the cue-response association in a separate group of mice, such that high-frequency tones require a left lever press and vice versa. This control would also help tease apart task-evoked responses in the aDLS, as I am given to understand all the recording sites were in the left striatum.", "type": "weakness", "axis": "soundness", "severity": "major"}
{"statement": "Strengths of the study are the use of multiple methodologies to measure and manipulate brain activity in rats, from microPET imaging to excitotoxic lesions and multielectrode recordings across anterior dorsolateral (aDLS), posterior ventral lateral (pVLS) and dorsomedial (DMS) striatum.", "type": "strength", "axis": "soundness", "severity": "major"}
{"statement": "The inclusion of important controls will enhance the rigor of the data interpretation and conclusions.", "type": "weakness", "axis": "soundness", "severity": "minor"}
