{"statement": "The authors mention that ROS can be passed between cells, but it would be helpful for them to provide more details about where this has been documented to occur and what biological functions ROS transfer regulates, as this is central to their hypothesis that CySCs generate an intercellular redox gradient to maintain physiological ROS levels in GSCs.", "type": "weakness", "axis": "soundness", "severity": "minor"}
{"statement": "There is no evidence provided to show that Sod1 manipulation in the soma is affecting ROS levels in the germline and that any of the phenotypes observed are a consequence of elevated ROS in the germline, rather than indirect effects caused by dysregulation of somatic self-renewal and differentiation, which is known to impact the germline.", "type": "weakness", "axis": "soundness", "severity": "major"}
{"statement": "Whether Sod1 plays any non-autonomous role in controlling germ cell fate through ROS in the germline directly, or whether the phenotypes observed can all be explained by autonomous effects on somatic cell behaviour is debatable, but the experiments presented here do not distinguish between these two hypotheses.", "type": "weakness", "axis": "soundness", "severity": "major"}
{"statement": "It would be hard to support the claim that somatic mitochondria are enriched at the CySC-GSC interface and that this distribution maintains the redox balance in the niche by any experimental data, despite the research plan including ATP5A immunostaining to examine mitochondrial distribution patterns.", "type": "weakness", "axis": "soundness", "severity": "major"}
{"statement": "No experiments are planned to test whether mitochondrial distribution in CySCs has any impact on GSCs, which is a key component of the hypothesis that CySCs generate intercellular redox gradients.", "type": "weakness", "axis": "soundness", "severity": "major"}
{"statement": "No experiments are planned to show definitively that the phenotypes observed upon Sod1 knockdown are indeed due to increased ROS, while this appeard to be a central point of the research plan.", "type": "weakness", "axis": "soundness", "severity": "major"}
{"statement": "The main strength of this work is to show a previously unappreciated role for Sod1 (and presumably by extension of ROS) in the Drosophila testis and in the regulation of stem cell self-renewal and differentiation.", "type": "strength", "axis": "contribution", "severity": "minor"}
{"statement": "The authors plan to conduct multiple readouts to show that the knockdown of Sod1 in the soma increases the number of somatic cells and also drives a non-autonomous, premature differentiation of germ cells. They also aim to quantify the early differentiation of the germline using two different methods.", "type": "strength", "axis": "soundness", "severity": "minor"}
{"statement": "One big caveat is that tj-Gal4 is expressed in hub cells so the loss of SOD from hub cells may also contribute to the phenotype, which could confound the interpretation of CySC-specific effects.", "type": "weakness", "axis": "soundness", "severity": "major"}
{"statement": "The ideal genotype for targeting CySCs is tjGal4, Gal80TS, hh-Gal80, which would provide better specificity than the current approach.", "type": "weakness", "axis": "soundness", "severity": "minor"}
{"statement": "The authors do not mention whether they are depleting Sod1 throughout development into adulthood or only in adults, which would be important for interpreting the results they eventually obtain about their genetic manipulation experiments.", "type": "weakness", "axis": "soundness", "severity": "minor"}
{"statement": "It would be very helpful if the authors depleted ATP5A from GSCs and showed that the puncta are reduced in these cells and did a similar set of experiments for the tj-Gal4 lineage to validate their mitochondrial distribution analysis.", "type": "weakness", "axis": "soundness", "severity": "minor"}
{"statement": "It would also be very helpful if the authors expressed membrane markers (like myr-GFP) in the GSC and then in the CySC lineage and then stained with ATP5A to pinpoint in which cells ATP5A immunoreactivity is occurring.", "type": "weakness", "axis": "soundness", "severity": "minor"}
{"statement": "The authors would need to monitor ROS in these tests to support their eventual claims about redox gradients and ROS-mediated effects.", "type": "weakness", "axis": "soundness", "severity": "major"}
