{"statement": "The phase method for inferring synaptic conductances fails to convince as it rests on many layers of assumptions and the inferred connections remain speculative.", "type": "weakness", "axis": "soundness", "severity": "major"}
{"statement": "To be convincing, such a method ought to be tested first on a model CPG with known connectivity to assess how good it is at inferring known connections back from the analysis of spatio-temporal oscillations.", "type": "weakness", "axis": "soundness", "severity": "major"}
{"statement": "The transformation from time to phase space, unlike in the Kuramoto model, is not justified in the proposed phase-based analysis approach and is wrong.", "type": "weakness", "axis": "soundness", "severity": "major"}
{"statement": "The underpinning idea that synaptic conductances depend on the cycle phase and not on time explicitly is flawed because synapses have characteristic decay times and delays to response which remain fixed when the period of network oscillations increases.", "type": "weakness", "axis": "soundness", "severity": "major"}
{"statement": "The method cannot account for change in the behaviour of inhibitory synapses from inhibitory to excitatory action when the inhibitory decay time becomes commensurable to the period of network oscillations.", "type": "weakness", "axis": "soundness", "severity": "major"}
{"statement": "Even small delays in the inhibitory synapse response relative to the pre-synaptic action potential also produce in-phase synchronization, which the present assumptions cannot account for.", "type": "weakness", "axis": "soundness", "severity": "major"}
{"statement": "The current balance equation makes extremely crude assumptions that the displacement current (CdV/dt) is negligible and that the ion channel currents are all negligible.", "type": "weakness", "axis": "soundness", "severity": "major"}
{"statement": "The assumption that the activation/inactivation times of all ion channels are small compared to the 10-20ms decay time of synaptic currents is not true in general.", "type": "weakness", "axis": "soundness", "severity": "major"}
{"statement": "The approach relies on a linear I-V relationship between the measured voltage and the estimated reversal potential, but open rectification is a feature of any I-V relationship generated by asymmetric distributions of ions and will be a particular issue for inhibition resulting from asymmetrical Cl- ion gradients across GABA-A receptors.", "type": "weakness", "axis": "soundness", "severity": "major"}
{"statement": "The mixed cation conductance that underlies most synaptic excitation will generate a non-linear I-V relationship due to the inward rectification associated with the polyamine block of AMPA receptors.", "type": "weakness", "axis": "soundness", "severity": "major"}
{"statement": "The method attempts to essentially deconvolve the underlying conductance changes without recording transmembrane current changes during stimulation at various command voltages, which may simply not be possible.", "type": "weakness", "axis": "soundness", "severity": "major"}
{"statement": "Without subtraction of the membrane capacitance, it is not possible to isolate the transmembrane current in the way that previous studies have done, and the voltage change due to capacitive currents should be taken into consideration before inferring underlying conductance changes.", "type": "weakness", "axis": "soundness", "severity": "major"}
{"statement": "Studies using acute slicing preparations to examine circuit effects are limited to small microcircuits and any information gained will be compromised by the absence of patterned afferent input from outside the brain region being studied.", "type": "weakness", "axis": "soundness", "severity": "major"}
{"statement": "In the proposed brainstem respiratory CPG experiments, descending control from the Pons and the neocortex will not be contributing much to the synaptic drive and ascending information from respiratory muscles will also be absent completely.", "type": "weakness", "axis": "soundness", "severity": "minor"}
