{"statement": "While the eBird dataset employed in this research holds promise, a rigorous justification of the core assumptions underpinning the analytical framework is inadequate.", "type": "weakness", "axis": "soundness", "severity": "major"}
{"statement": "The authors should thoroughly address the correlation between eBird checklist data and global range data, ensuring that the foundational assumptions and potential confounding factors are explicitly examined and articulated within the study's context.", "type": "weakness", "axis": "soundness", "severity": "major"}
{"statement": "This study combines information from across the whole world, with many different habitats, taxa, and observations, which surely leads to a quite heterogeneous collection.", "type": "weakness", "axis": "soundness", "severity": "minor"}
{"statement": "The research plan should state whether this study is only looking at breeding ranges, as 40% of all bird species migrate, and winter limitation of populations is important.", "type": "weakness", "axis": "soundness", "severity": "minor"}
{"statement": "It should be clarified whether abundances from eBird checklists are only breeding abundances or are they measured through the year.", "type": "weakness", "axis": "soundness", "severity": "minor"}
{"statement": "The research plan should specify whether alien distributions are removed from the analysis.", "type": "weakness", "axis": "soundness", "severity": "minor"}
{"statement": "As noted in the research plan, common species may be underestimated in their abundance, which introduces systematic bias.", "type": "weakness", "axis": "soundness", "severity": "major"}
{"statement": "Flocking species must generate large numbers while skulking species few, introducing species-specific biases in eBird abundance estimates.", "type": "weakness", "axis": "soundness", "severity": "major"}
{"statement": "The eBird survey is often likely to be in areas favorable to some species and not others, introducing spatial sampling bias.", "type": "weakness", "axis": "soundness", "severity": "major"}
{"statement": "Biases are present in range size estimates as well, notably tropical mountain-occupying species have range sizes over-estimated because holes in the range are not generally accounted for.", "type": "weakness", "axis": "soundness", "severity": "major"}
{"statement": "Random error in eBird assessments is likely to be large, with differences among observers, seasons, days, and weather.", "type": "weakness", "axis": "soundness", "severity": "major"}
{"statement": "Range sizes also come with many errors, which is why occupancy is usually seen as the more appropriate measure than range size.", "type": "weakness", "axis": "soundness", "severity": "major"}
{"statement": "The statement that increases in species richness and sampling duration are predicted to reduce the magnitude of AORs appears counterintuitive, as more species and longer durations should both increase the accuracy of the estimate.", "type": "weakness", "axis": "soundness", "severity": "minor"}
{"statement": "The authors are not really measuring the abundance-occupancy relationship (AOR) but rather abundance-range size relationship, which is conceptually different.", "type": "weakness", "axis": "contribution", "severity": "major"}
{"statement": "The AOR typically measures patches in a metapopulation at a local scale, while range size is not an interchangeable notion with local occupancy.", "type": "weakness", "axis": "contribution", "severity": "major"}
{"statement": "eBird is a poor dataset for measuring abundance-occupancy relationships because the sampling unit is non-standard.", "type": "weakness", "axis": "soundness", "severity": "major"}
{"statement": "Abundance can at best be estimated by controlling for sampling effort when using eBird data, and comparisons across space are likely to be highly heterogeneous.", "type": "weakness", "axis": "soundness", "severity": "major"}
{"statement": "The research plan excludes checklists containing 'X' entries where abundances were too high to be estimated, which may introduce selection bias.", "type": "weakness", "axis": "soundness", "severity": "minor"}
