{"statement": "The research plan offers a comparative study between various methodologies to evaluate the abundance, richness, and diversity of insects from data obtained in a large-scale field experiment, focusing on the validation of a novel approach based on optical sensors that collect backscattered light from flying insects and can retrieve wingbeat frequency and body-to-wing backscattering ratios.", "type": "strength", "axis": "contribution", "severity": "minor"}
{"statement": "The methodology to retrieve richness and diversity from optical sensors using DBSCAN clustering appears flawed because the parameters (minimum number of signals and merge distance) will greatly influence the number of clusters found, making both diversity and richness greatly dependent on the chosen parameters.", "type": "weakness", "axis": "soundness", "severity": "minor"}
{"statement": "Regarding the calculation of the body-to-wing ratio, the description of sigma is inconsistent - described as a 'signal' in one context and as intensity counts in another, when it should be the backscattering optical cross-section, and it's unclear how one value of sigma is calculated when it changes significantly over time during the signal.", "type": "weakness", "axis": "soundness", "severity": "minor"}
{"statement": "There is a major methodological problem in the approach where DBSCAN parameters that directly impact the retrieved diversity and richness by optical sensors are optimized to maximize correlation with richness from conventional methods, which will automatically create a correlation between the optical sensor metrics and alternative methods.", "type": "weakness", "axis": "soundness", "severity": "major"}
{"statement": "The clustering method using only two features (wingbeat frequency and body-to-wing ratio) provides values higher than 80 clusters, which is quite unrealistic given that optical sensor features are subject to significant variability due to natural variance within species, temperature dependency, insect orientation, and position within the measurement volume.", "type": "weakness", "axis": "soundness", "severity": "major"}
{"statement": "The research plan mentions two wavelengths (810 nm & 970 nm) in the optical sensor description but these additional features that could help improve clustering are never utilized in the analysis.", "type": "weakness", "axis": "soundness", "severity": "minor"}
{"statement": "Contrasting the results of optical sensors with those obtained with classical Malaise traps and sweep net survey methodologies was a clever approach.", "type": "strength", "axis": "soundness", "severity": "minor"}
{"statement": "The research lacks a larger scientific question that the new optical sensor technology can help to answer, missing the opportunity to frame the aims beyond just presenting a new sampling tool to address specific hypotheses in agricultural field research.", "type": "weakness", "axis": "contribution", "severity": "major"}
{"statement": "The research plan lacks more complex analyses, as the authors focus too narrowly on counts of abundance and species richness rather than exploring more complex patterns that could be revealed in their optical sensor data.", "type": "weakness", "axis": "contribution", "severity": "major"}
